<?php
$servername = "localhost"; // Ορίζει το όνομα του διακομιστή της βάσης δεδομένων
$username = "root"; // Ορίζει το όνομα χρήστη για τη σύνδεση στη βάση δεδομένων
$password = ""; // Ορίζει τον κωδικό για τη σύνδεση στη βάση δεδομένων (άδειο για τοπική βάση)
$dbname = "ds_estate"; // Ορίζει το όνομα της βάσης δεδομένων που θα χρησιμοποιηθεί

// Δημιουργία σύνδεσης με τη βάση δεδομένων
$conn = new mysqli($servername, $username, $password, $dbname);

// Έλεγχος σύνδεσης
if ($conn->connect_error) { // Ελέγχει αν υπάρχει σφάλμα σύνδεσης
    die("Connection failed: " . $conn->connect_error); // Εμφανίζει μήνυμα σφάλματος και τερματίζει το script
}
?>
