<?php
$servername = "localhost"; // Ορίζει το όνομα του διακομιστή της βάσης δεδομένων
$username = "root"; // Ορίζει το όνομα χρήστη για τη σύνδεση στη βάση δεδομένων
$password = ""; // Ορίζει τον κωδικό πρόσβασης για τη σύνδεση στη βάση δεδομένων
$dbname = "ds_estate"; // Ορίζει το όνομα της βάσης δεδομένων που θα χρησιμοποιηθεί

// Δημιουργία σύνδεσης στη βάση δεδομένων
$conn = new mysqli($servername, $username, $password, $dbname);

// Έλεγχος σύνδεσης
if ($conn->connect_error) { // Ελέγχει αν υπάρχει σφάλμα σύνδεσης
    die("Η σύνδεση απέτυχε: " . $conn->connect_error); // Εμφανίζει μήνυμα σφάλματος και σταματάει την εκτέλεση του κώδικα
}
?>
